test_cases/mixerVesselAMI/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10;

deltaT          1e-4;

writeControl    adjustable;

writeInterval   0.05;

purgeWrite      10;     // save last 0.5s

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   10;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           1.5;

maxAlphaCo      1;

maxDeltaT       1;


// ************************************************************************* //

functions{

    probes
        {
            type            probes;
            libs            (sampling);
            name            probes;
            writeControl    timeStep;
            writeInterval   1;
            startTime       0.0;
            fields          (U p);
            fixedLocations  true;
            interpolationScheme cell;

            probeLocations
            (
                // radial dist = const., probe locations just change wrt cylinder hight
                // 0.264993 = r_vessel, z_max = 1.1 (vessel), z_min = -0.1 (vessel) -> gerader teil der wand geht von z = 0...1, rotoren gehen bis ca. y = 0.17 +-
                // -> y = 0.22 ist ca. in mitte zwischen Wand und Rotoren
                (0.0 0.22 0.0)
                (0.0 0.22 0.1)
                (0.0 0.22 0.2)
                (0.0 0.22 0.3)
                (0.0 0.22 0.4)
                (0.0 0.22 0.5)
                (0.0 0.22 0.6)
                (0.0 0.22 0.7)
                (0.0 0.22 0.8)
                (0.0 0.22 0.9)
                (0.0 0.22 1.0)

            );
            includeOutOfBounds  false;
        }
}
